package ru.practicum.utils;

import org.apache.commons.lang3.RandomStringUtils;

import java.time.LocalDate;
import java.time.format.DateTimeFormatter;
import java.util.concurrent.ThreadLocalRandom;

public class Utils {

    //Получаем случайный логин
    public static String randomLogin() {
        return RandomStringUtils.random(8, true, true);
    }

    //Получаем случайный пароль
    public static String randomPassword() {
        return RandomStringUtils.random(12, true, true);
    }

    //Получаем случайное имя
    public static String randomFirstName() {
        return RandomStringUtils.randomAlphabetic(10);
    }

    //Получаем случайную фамилию
    public static String randomLastName() {
        return RandomStringUtils.randomAlphabetic(12);
    }

    //Получаем случайный коммент
    public static String randomComment() {
        return RandomStringUtils.randomAlphabetic(7) + " " + RandomStringUtils.randomAlphabetic(5);
    }
    //Получаем случайный номер телефона
    public static String randomPhone(){
        return "+7" + ThreadLocalRandom.current().nextLong(1000000000L, 9999999999L);
    }
    //Получаем случайной количество дней аренды
    public static int randomRentTime(){
        return  Integer.valueOf(RandomStringUtils.random(1, false, true));
    }

    // Получаем случайную дату в пределах 10 дней
    public static String randomDeliveryDate(){
        DateTimeFormatter formatter = DateTimeFormatter.ofPattern("yyyy-MM-dd");
        return LocalDate.now().plusDays(ThreadLocalRandom.current().nextInt(1, 10)).format(formatter);
    }

    // Получаем случайный адрес
    public static String randomAddress() {
        String[] streets = {"ул. Пушкина, д.3", "ул. Лермонтова, д.5", "ул. Достаевского, д.7", "ул. Толстого, д.1", "ул. Грибоедова, д.9"};
        return streets[ThreadLocalRandom.current().nextInt(0, streets.length)];
    }

    // Получаем случайную станцию метро
    public static String randomMetroStation() {
        String[] stationNames = {"Бульвар Рокоссовского", "Охотный Ряд", "Сухаревская", "Тургеневская", "Китай-город", "Третьяковская", "Октябрьская",
                "Шаболовская", "Ленинский проспект", "Академическая", "Профсоюзная", "Новые Черёмушки", "Библиотека имени Ленина", "Калужская", "Беляево",
                "Коньково", "Тёплый Стан", "Ясенево", "Новоясеневская", "Планерная", "Сходненская", "Тушинская", "Спартак", "Кропоткинская", "Щукинская",
                "Октябрьское поле", "Полежаевская", "Беговая", "Улица 1905 года", "Баррикадная", "Пушкинская", "Кузнецкий Мост", "Китай-город", "Таганская",
                "Парк культуры", "Пролетарская", "Волгоградский проспект", "Текстильщики", "Кузьминки", "Рязанский проспект", "Выхино", "Лермонтовский проспект",
                "Жулебино", "Котельники", "Раменки", "Фрунзенская", "Ломоносовский проспект", "Минская", "Парк Победы", "Деловой центр", "Третьяковская",
                "Марксистская", "Площадь Ильича", "Авиамоторная", "Шоссе Энтузиастов", "Перово", "Спортивная", "Новогиреево", "Новокосино", "Алтуфьево", "Бибирево",
                "Отрадное", "Владыкино", "Петровско-Разумовская", "Тимирязевская", "Дмитровская", "Савёловская", "Воробьёвы горы", "Менделеевская", "Цветной бульвар",
                "Чеховская", "Боровицкая", "Полянка", "Серпуховская", "Тульская", "Нагатинская", "Нагорная", "Нахимовский проспект", "Университет", "Севастопольская",
                "Чертановская", "Южная", "Пражская", "Улица Академика Янгеля", "Аннино", "Бульвар Дмитрия Донского", "Петровско-Разумовская", "Фонвизинская", "Бутырская",
                "Проспект Вернадского", "Марьина роща", "Достоевская", "Трубная", "Сретенский бульвар", "Чкаловская", "Римская", "Крестьянская застава", "Дубровка",
                "Кожуховская", "Печатники", "Юго-Западная", "Волжская", "Люблино", "Братиславская", "Марьино", "Борисово", "Шипиловская", "Зябликово", "Каширская",
                "Варшавская", "Каховская", "Черкизовская", "Тропарёво", "Битцевский парк", "Лесопарковая", "Улица Старокачаловская", "Улица Скобелевская",
                "Бульвар Адмирала Ушакова", "Улица Горчакова", "Бунинская аллея", "Окружная", "Владыкино", "Ботанический сад", "Румянцево", "Ростокино", "Белокаменная",
                "Бульвар Рокоссовского", "Локомотив", "Измайлово", "Соколиная Гора", "Шоссе Энтузиастов", "Андроновка", "Нижегородская", "Новохохловская", "Саларьево",
                "Угрешская", "Дубровка", "Автозаводская", "ЗИЛ", "Верхние Котлы", "Крымская", "Площадь Гагарина", "Лужники", "Кутузовская", "Деловой центр",
                "Речной вокзал", "Шелепиха", "Хорошёво", "Зорге", "Панфиловская", "Стрешнево", "Балтийская", "Коптево", "Лихоборы", "Водный стадион", "Войковская",
                "Сокол", "Аэропорт", "Динамо", "Белорусская", "Преображенская площадь", "Маяковская", "Тверская", "Театральная", "Новокузнецкая", "Павелецкая",
                "Автозаводская", "Технопарк", "Коломенская", "Каширская", "Кантемировская", "Сокольники", "Царицыно", "Орехово", "Домодедовская", "Красногвардейская",
                "Алма-Атинская", "Пятницкое шоссе", "Митино", "Волоколамская", "Мякинино", "Строгино", "Красносельская", "Крылатское", "Молодёжная", "Кунцевская",
                "Славянский бульвар", "Парк Победы", "Киевская", "Смоленская", "Арбатская", "Площадь Революции", "Курская", "Комсомольская", "Бауманская",
                "Электрозаводская", "Семёновская", "Партизанская", "Измайловская", "Первомайская", "Щёлковская", "Кунцевская", "Пионерская", "Филёвский парк",
                "Красные Ворота", "Багратионовская", "Фили", "Кутузовская", "Студенческая", "Международная", "Выставочная", "Киевская", "Смоленская", "Арбатская",
                "Александровский сад", "Чистые пруды", "Лубянка", "Медведково", "Бабушкинская", "Свиблово", "Ботанический сад", "ВДНХ", "Алексеевская", "Рижская",
                "Проспект Мира"};

        return stationNames[ThreadLocalRandom.current().nextInt(0, stationNames.length)];
    }





}
